/*ЗАВДАННЯ 1
Створити клас для обробки записів бази даних у відповідності з наданим варіантом. Розмістити інтерфейс класу у  заголовочному файлі, а визначення функцій та головну функцію програми – у двох окремих файлах. Передбачити можливість роботи з довільним числом записів, а також реалізувати окремими функціями класу:  
-	конструктори без параметрів та з параметрами ; 
-	додавання; 
-	знищення; 
-	виведення інформації на екран; 
-	пошук потрібної інформації за конкретною ознакою; 
-	редагування записів; 
-	сортування за різними полями.  
Використайте захищення даних для ізоляції елементів-даних класу від підпрограм, в яких цей клас використовується. Програма повинна містити меню для перевірки всіх методів класу. 
*/

/*8. „СКЛАД ТОВАРІВ”  - Інвентарний номер, назва товару, вага, ціна, кількість. */
#pragma once
#include<iostream>
#include<fstream>
#include<string>
#include<exception>

using namespace std;
class Warehouse {
private:
		int Inventory_number;
		string name_p;
		float weight;
		float price;
		int numerosity;

public:
	Warehouse();//+
	Warehouse(int s);//+

	void add();//добавление +
	void del();// удаления 
	void read();// чтение из файла +
	void sort_Inventory_number();//сортировать за разными показателями 
	void sort_Price();
	void sort_name();
	void search();//поиск за ознакой
	void input();
	void update();



};

